wms_mobile/src/Enums/итWMSТипыЗадачТСД/итWMSТипыЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSТипыЗадачТСД</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>Наборка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКакЕсть</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>КонтрольнаяАгрегация</name>
  </enumValues>
  <enumValues>
    <name>Проверка</name>
  </enumValues>
  <enumValues>
    <name>Переупаковка</name>
  </enumValues>
</mdclass:Enum>

wms_mobile/src/Documents/итПеремещение/итПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итПеремещение</name>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихКодыЯчеекДокумента</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

wms_mobile/src/CommonModules/ОбработчикДанныхПеремещения/Module.bsl
// Процедура - О бработать документ перемещение
//
// Параметры:
//  Документ			 - Структура - структура содержащая в себе данные документа на сервере 
//  АдресХраненияДанных	 - Строка - адрес временного хранилища или адрес Временного хранилища формы, получаемого методом СлужебныеФункцииИПроцедурыКлиентСервер.ПоместитьВоВременноеХранилищеФормы
//
Процедура ОБработатьДокументПеремещение(Документ,АдресХраненияДанных="")Экспорт 
ТипОбрабатываемойЗадачи=Перечисления.итWMSТипыЗадачТСД.Перемещение;
ДокументТСД=НайтиСоздатьДокументПеремещения(Документ,ТипОбрабатываемойЗадачи,АдресХраненияДанных);
Если не Документ.Свойство("МассивЗадач") тогда
	ВызватьИсключение "Ошибка типа данных";
КонецЕсли;
	
Если ТипЗнч(Документ.ДополнительныеДанные)=тип("Структура") тогда
	
	Если  Документ.ДополнительныеДанные.Свойство("ДанныеШтрихКодовЯчеекДокумента") тогда
		ОбъектДокументаТСД=ДокументТСД.ПолучитьОбъект();
		
		ДанныеШтрихКодовЯчеекДокумента= Документ.ДополнительныеДанные.ДанныеШтрихКодовЯчеекДокумента;
		ОбъектДокументаТСД.ШтрихКодыЯчеекДокумента.Очистить();
		для Каждого стр из  ДанныеШтрихКодовЯчеекДокумента цикл
			НоваяСтрокаДополнительныхДанных=ОбъектДокументаТСД.ШтрихКодыЯчеекДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДополнительныхДанных,стр);
		КонецЦикла;
		ОбъектДокументаТСД.Записать();
		
	КонецЕсли;
	
	
КонецЕсли;

СтруктураТиповыхПараметровЗадач=ОбработчикДанныхОбщиеФункцииИПроцедуры.СформироватьТиповуюСтруктуруПараметровДанныхЗадач(,ДокументТСД,ТипОбрабатываемойЗадачи,АдресХраненияДанных);
Если Документ.Свойство("ПомарочныйУчет")  Тогда
	СтруктураТиповыхПараметровЗадач.ЗапроситьДанныеМарок=Документ.ПомарочныйУчет
иначе
	СтруктураТиповыхПараметровЗадач.ЗапроситьДанныеМарок=Ложь;
КонецЕсли;

для Каждого Задача из Документ.МассивЗадач цикл
	СтруктураТиповыхПараметровЗадач.Задача=Задача;
	ОбработчикДанныхОбщиеФункцииИПроцедуры.ОбработчикСозданиеИзменениеУдалениеЗадач(СтруктураТиповыхПараметровЗадач);
КонецЦикла;
////СлужебныеФункцииИПроцедурыКлиентСервер.ДобавитьВЛог(,"+#ОбработчикДанныхПеремещения Запрос марок , если они есть к наборке. Количество задач:"+СтруктураТиповыхПараметровЗадач.МассивИдЗадачПомарочногоУчета.Количество(),Документ.ГУИД);
Если СтруктураТиповыхПараметровЗадач.ЗапроситьДанныеМарок Тогда 
ОбработчикДанныхОбщиеФункцииИПроцедуры.ПолучитьДанныеМарокПоСпискуЗадач(СтруктураТиповыхПараметровЗадач.МассивИдЗадачПомарочногоУчета,СтруктураТиповыхПараметровЗадач.ТипОбрабатываемойЗадачи)	
КонецЕсли;
////СлужебныеФункцииИПроцедурыКлиентСервер.ДобавитьВЛог(,"-#ОбработчикДанныхПеремещения окончание запроса мрок",Документ.ГУИД);

ОбработчикДанныхОбщиеФункцииИПроцедуры.ПроверитьУдалитьДокумент(ДокументТСД,АдресХраненияДанных);

КонецПроцедуры


#Область СлужебныеФункцииИпроцедурыПриемки
Функция НайтиСоздатьДокументПеремещения(Документ,ТипЗадачи,АдресХраненияДанных="")
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итПеремещение.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.итПеремещение КАК итПеремещение
		|ГДЕ
		|	итПеремещение.ГУИД = &ГУИД";
	
	Запрос.УстановитьПараметр("ГУИД", Документ.ГУИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	иначе
		НовыйДокументПеремещения = Документы.итПеремещение.СоздатьДокумент();
		НовыйДокументПеремещения.ГУИД=Документ.ГУИД;
		НовыйДокументПеремещения.Номер=Документ.Номер;
		НовыйДокументПеремещения.Дата=Документ.Дата;
		НовыйДокументПеремещения.ТипЗадачи=ТипЗадачи;
		//Если ТипЗнч(Документ.ДополнительныеДанные)=Тип("Массив") тогда
		//	для Каждого стр из Документ.ДополнительныеДанные цикл
		//		НоваяСтрокаФизическихДанных=НовыйДокументПриемки.ДанныеФизическогоНосителя.Добавить();
		//		ЗаполнитьЗначенияСвойств(НоваяСтрокаФизическихДанных,стр);
		//		
		//	КонецЦикла;
		//КонецЕсли;
		НовыйДокументПеремещения.Записать();
		Если ЗначениеЗаполнено(АдресХраненияДанных) тогда
		ОбработчикДанныхОбщиеФункцииИПроцедуры.РаботаСВременнымХранилищемМассивИзменений(АдресХраненияДанных,"Создан",НовыйДокументПеремещения.Ссылка);
		КонецЕсли;
		Возврат НовыйДокументПеремещения.Ссылка;
	КонецЕсли;	
			
		//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	КонецФункции
#КонецОбласти
